theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TSTOP</name>
                                <description>Stop Condition Interrupt</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TDMA_DONE_TX</name>
                                <description>DMA Done on Event Channel TX</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TDMA_DONE_RX</name>
                                <description>DMA Done on Event Channel RX</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CPEC_RX_ERR</name>
                                <description>Controller RX Pec Error Interrupt</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIMEOUTB</name>
                                <description>Timeout B Interrupt</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TPEC_RX_ERR</name>
                                <description>Target RX Pec Error Interrupt</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TTX_UNFL</name>
                                <description>Target TX FIFO underflow</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TRX_OVFL</name>
                                <description>Target RX FIFO overflow</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TARBLOST</name>
                                <description>Target Arbitration Lost</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>INTR_OVFL</name>
                                <description>Interrupt overflow</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
