theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x9</bitWidth>
                                </field>
                            <field>
                                <name>PECEN</name>
                                <description>PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>PEC transmission and check is disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>PEC transmission and check is enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2C1_TARGET_PECSR</name>
                        <description>I2C Target PEC status register</description>
                        <addressOffset>0x28</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>PECBYTECNT</name>
                                <description>This is the current PEC Byte Count of the Target State Machine.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x9</bitWidth>
                                </field>
                            <field>
                                <name>PECSTS_CHECK</name>
                                <description>This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEARED</name>
                                            <description>Indicates PEC was not checked in the transaction that occurred before the last Stop</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Indicates PEC was checked in the transaction that occurred before the last Stop</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>PECSTS_ERROR</name>
                                <description>This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop.</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEARED</name>
                                            <description>Indicates PEC check error did not occurr in the transaction that occurred before the last Stop</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Indicates PEC check error occurred in the transaction that occurred before the last Stop</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
            </registers>
        </peripheral>
        <peripheral>
            <name>EVENTLP</name>
            <groupName>EVENTLP</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x400C9000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EVENTLP_PUBCFG_DESC_EX</name>
                    <description>Extended Module Description</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_SINGLE_CHANNEL</name>
                            <description>Number of single channels contained in this instance of event manager</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_DUAL_CHANNEL</name>
                            <description>Number of dual channels contained in this instance of event manager</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_IMPORT</name>
                            <description>Number of import ports available in this EventManager instantiation</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_EXPORT</name>
                            <description>Number of export ports available in this EventManager instantiation</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>EVENTLP_PUBCFG_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>100</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_FSUB[%s]</name>
                    <description></description>
                    <addressOffset>0x100</addressOffset>
                    <register>
                        <dim>25</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24</dimArrayIndex>
                        <name>EVENTLP_PUBCFG_FSUB_PORT[%s]</name>
                        <description>Subscriber channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for subscriber to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>84</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_FPUB[%s]</name>
                    <description></description>
                    <addressOffset>0x300</addressOffset>
                    <register>
                        <dim>21</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20</dimArrayIndex>
                        <name>EVENTLP_PUBCFG_FPUB_PORT[%s]</name>
                        <description>Publisher channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for publisher to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x500</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for export side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x700</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>108</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_CPU_CONNECT[%s]</name>
                    <description></description>
                    <addressOffset>0x900</addressOffset>
                    <register>
                        <dim>27</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26</dimArrayIndex>
                        <name>EVENTLP_PUBCFG_CPU_NUM[%s]</name>
                        <description>CPU connect register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                    </register>
                </cluster>
                <register>
                    <name>EVENTLP_SECCFG_DESC_EX</name>
                    <description>Extended Module Description</description>
                    <addressOffset>0x10F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_SINGLE_CHANNEL</name>
                            <description>Number of single channels contained in this instance of event manager</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_DUAL_CHANNEL</name>
                            <description>Number of dual channels contained in this instance of event manager</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_EXPORT</name>
                            <description>Number of export ports available in this EventManager instantiation</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_IMPORT</name>
                            <description>Number of import ports available in this EventManager instantiation</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>EVENTLP_SECCFG_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>25</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_FSUB[%s]</name>
                    <description></description>
                    <addressOffset>0x1100</addressOffset>
                    <register>
                        <dim>25</dim>
                        <dimIncrement>1</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24</dimArrayIndex>
                        <name>EVENTLP_SECCFG_FSUB_PORT[%s]</name>
                        <description>Subscriber channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for subscriber to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>21</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_FPUB[%s]</name>
                    <description></description>
                    <addressOffset>0x1180</addressOffset>
                    <register>
                        <dim>21</dim>
                        <dimIncrement>1</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20</dimArrayIndex>
                        <name>EVENTLP_SECCFG_FPUB_PORT[%s]</name>
                        <description>Publisher channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for publisher to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
