theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO21</name>
                            <description>This bit sets the value of the pin configured as DIO21 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO22</name>
                            <description>This bit sets the value of the pin configured as DIO22 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO23</name>
                            <description>This bit sets the value of the pin configured as DIO23 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO24</name>
                            <description>This bit sets the value of the pin configured as DIO24 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO25</name>
                            <description>This bit sets the value of the pin configured as DIO25 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO26</name>
                            <description>This bit sets the value of the pin configured as DIO26 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO27</name>
                            <description>This bit sets the value of the pin configured as DIO27 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO28</name>
                            <description>This bit sets the value of the pin configured as DIO28 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO29</name>
                            <description>This bit sets the value of the pin configured as DIO29 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO30</name>
                            <description>This bit sets the value of the pin configured as DIO30 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIO31</name>
                            <description>This bit sets the value of the pin configured as DIO31 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
