theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                    <register>
                        <name>I2C0_DMA_TRIG0_IMASK</name>
                        <description>Interrupt mask</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CRXFIFOTRG</name>
                                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CTXFIFOTRG</name>
                                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TRXFIFOTRG</name>
                                <description>Target Receive FIFO Trigger</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TTXFIFOTRG</name>
                                <description>Target Transmit FIFO Trigger</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2C0_DMA_TRIG0_RIS</name>
                        <description>Raw interrupt status</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CRXFIFOTRG</name>
                                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CTXFIFOTRG</name>
                                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TRXFIFOTRG</name>
                                <description>Target Receive FIFO Trigger</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TTXFIFOTRG</name>
                                <description>Target Transmit FIFO Trigger</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2C0_DMA_TRIG0_MIS</name>
                        <description>Masked interrupt status</description>
                        <addressOffset>0x18</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CRXFIFOTRG</name>
                                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CTXFIFOTRG</name>
                                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TRXFIFOTRG</name>
                                <description>Target Receive FIFO Trigger</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TTXFIFOTRG</name>
                                <description>Target Transmit FIFO Trigger</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2C0_DMA_TRIG0_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CRXFIFOTRG</name>
                                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CTXFIFOTRG</name>
                                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TRXFIFOTRG</name>
                                <description>Target Receive FIFO Trigger</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TTXFIFOTRG</name>
                                <description>Target Transmit FIFO Trigger</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
