theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>SPI0_CTL0</name>
                    <description>SPI control register 0</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DSS</name>
                            <description>Data Size Select.
Values 0 - 2 are reserved and shall not be used.
3h = 4_BIT : 4-bit data
SPI allows only values up to 16 Bit</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DSS_4</name>
                                        <description>Data Size Select bits: 4</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_5</name>
                                        <description>Data Size Select bits: 5</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_6</name>
                                        <description>Data Size Select bits: 6</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_7</name>
                                        <description>Data Size Select bits: 7</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_8</name>
                                        <description>Data Size Select bits: 8</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_9</name>
                                        <description>Data Size Select bits: 9</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_10</name>
                                        <description>Data Size Select bits: 10</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_11</name>
                                        <description>Data Size Select bits: 11</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_12</name>
                                        <description>Data Size Select bits: 12</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_13</name>
                                        <description>Data Size Select bits: 13</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_14</name>
                                        <description>Data Size Select bits: 14</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_15</name>
                                        <description>Data Size Select bits: 15</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_16</name>
                                        <description>Data Size Select bits: 16</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FRF</name>
                            <description>Frame format Select</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MOTOROLA_3WIRE</name>
                                        <description>Motorola SPI frame format (3 wire mode)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MOTOROLA_4WIRE</name>
                                        <description>Motorola SPI frame format (4 wire mode)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TI_SYNC</name>
                                        <description>TI synchronous serial frame format</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MIRCOWIRE</name>
                                        <description>National Microwire frame format</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SPO</name>
                            <description>CLKOUT polarity (Motorola SPI frame format only)</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>SPI produces a steady state LOW value on the CLKOUT</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGH</name>
                                        <description>SPI produces a steady state HIGH value on the CLKOUT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SPH</name>
                            <description>CLKOUT phase (Motorola SPI frame format only)
This bit selects the clock edge that captures data and enables it to change state. It
has the most impact on the first bit transmitted by either permitting or not permitting a clock transition before the first data capture edge.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FIRST</name>
                                        <description>Data is captured on the first clock edge transition.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SECOND</name>
                                        <description>Data is captured on the second clock edge transition.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CSSEL</name>
                            <description>Select the CS line to control on data transfer
This bit is applicable for both controller/target mode</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CSSEL_0</name>
                                        <description>CS line select: 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CSSEL_1</name>
                                        <description>CS line select: 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CSSEL_2</name>
                                        <description>CS line select: 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CSSEL_3</name>
                                        <description>CS line select: 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CSCLR</name>
                            <description>Clear shift register counter on CS inactive
This bit is relevant only in the peripheral, CTL1.CP=0.</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable automatic clear of shift register when CS goes to disable.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable automatic clear of shift register when CS goes to disable.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PACKEN</name>
                            <description>Packing Enable.
When 1, packing feature is enabled inside the IP
When 0, packing feature is disabled inside the IP</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>Packing feature disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description>Packing feature enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SPI0_CTL1</name>
                    <description>SPI control register 1</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000004</resetValue>
                    <fields>
                        <field>
                            <name>LBM</name>
                            <description>Loop back mode</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable loopback mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable loopback mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CP</name>
                            <description>Controller or peripheral mode select. This bit can be modified only when SPI is disabled, CTL1.ENABLE=0.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Select Peripheral mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Select Controller Mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>POD</name>
                            <description>Peripheral-mode: Data output disabled
This bit is relevant only in Peripheral mode. In multiple-peripheral system topologies, SPI controller can broadcast a message to all peripherals, while only one peripheral drives the line. 
POD can be used by the SPI peripheral to disable driving data on the line.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPI can drive the MISO output in peripheral mode.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPI cannot drive the MISO output in peripheral mode.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MSB</name>
                            <description>MSB first select. Controls the direction of the receive and transmit shift register.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>LSB first</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>MSB first</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PREN</name>
                            <description>Parity receive enable
If enabled, parity reception check will be done for both controller and peripheral modes
In case of a parity miss-match the parity error flag RIS.PER will be set.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable Parity receive function</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable Parity receive function</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REPEATTX</name>
                            <description>Counter to repeat last transfer
0: repeat last transfer is disabled.
x: repeat the last transfer with the given number.
The transfer will be started with writing a data into the TX Buffer. Sending the data will be repeated with the given value, so the data will be transferred X+1 times in total.
The behavior is identical as if the data would be written into the TX Buffer that many times as defined by the value here.
It can be used to clean a transfer or to pull a certain amount of data by a peripheral.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>REPEATTX disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PES</name>
                            <description>Even Parity Select</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Odd Parity mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Even Parity mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CDMODE</name>
                            <description>Command/Data Mode Value

When CTL1.CDENABLE is 1, CS3 line is used as C/D signal to distinguish between Command (C/D low) and Data (C/D high) information.

