theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>UART4_EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INT0_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>INT1_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>INT2_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART4_INTCTL</name>
                    <description>Interrupt control register</description>
                    <addressOffset>0x10E4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INTEVAL</name>
                            <description>Writing a 1 to this field re-evaluates the interrupt sources.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EVAL</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
