theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                    <register>
                        <name>I2C2_DMA_TRIG0_ICLR</name>
                        <description>Interrupt clear</description>
                        <addressOffset>0x28</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CRXFIFOTRG</name>
                                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CTXFIFOTRG</name>
                                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TRXFIFOTRG</name>
                                <description>Target Receive FIFO Trigger</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TTXFIFOTRG</name>
                                <description>Target Transmit FIFO Trigger</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Clear Interrupt Mask</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Set Interrupt Mask</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>I2C2_EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INT0_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.CPU_INT]</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>INT1_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.DMA_TRIG1]</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EVT2_CFG</name>
                            <description>Event line mode select for event corresponding to [IPSTANDARD.DMA_TRIG0]</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2C2_INTCTL</name>
                    <description>Interrupt control register</description>
                    <addressOffset>0x10E4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INTEVAL</name>
                            <description>Writing a 1 to this field re-evaluates the interrupt sources.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EVAL</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2C2_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2C2_GFCTL</name>
                    <description>I2C Glitch Filter Control</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>AGFSEL</name>
                            <description>Analog Glitch Suppression Pulse Width
This field controls the pulse width select for the analog glitch suppression on SCL and SDA lines. 
See device datasheet for exact values.
(ULP I2C only)</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>AGLIT_5</name>
                                        <description>Pulses shorter then 5ns length are filtered.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>AGLIT_10</name>
                                        <description>Pulses shorter then 10ns length are filtered.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>AGLIT_25</name>
                                        <description>Pulses shorter then 25ns length are filtered.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>AGLIT_50</name>
                                        <description>Pulses shorter then 50ns length are filtered.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DGFSEL</name>
                            <description>Glitch Suppression Pulse Width 
This field controls the pulse width select for glitch suppression on the SCL and SDA lines. The following values are the glitch suppression values in terms of functional clocks.  
(Core Domain only)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>Bypass</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_1</name>
                                        <description>1 clock</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_2</name>
                                        <description>2 clocks</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_3</name>
                                        <description>3 clocks</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_4</name>
                                        <description>4 clocks</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_8</name>
                                        <description>8 clocks</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_16</name>
                                        <description>16 clocks</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK_31</name>
                                        <description>31 clocks</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>AGFEN</name>
                            <description>Analog Glitch Suppression Enable</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Analog Glitch Filter disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Analog Glitch Filter enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CHAIN</name>
                            <description>Analog and digital noise filters chaining enable.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>When 0, chaining is disabled and only digital filter output is available to IP logic for oversampling</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>When 1, analog and digital glitch filters are chained and the output of the combination is made available to IP logic for oversampling</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2C2_TIMEOUT_CTL</name>
                    <description>I2C Timeout Count Control Register</description>
                    <addressOffset>0x1204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00020002</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TCNTLA</name>
                            <description>Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 

