theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                    <register>
                        <name>I2C2_TFIFOCTL</name>
                        <description>I2C Target FIFO Control</description>
                        <addressOffset>0x1C</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>TXTRIG</name>
                                <description>TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LEVEL_4</name>
                                            <description>Trigger when TX FIFO contains  4 byte</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LEVEL_5</name>
                                            <description>Trigger when TX FIFO contains  5 byte</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LEVEL_6</name>
                                            <description>Trigger when TX FIFO contains  6 byte</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LEVEL_7</name>
                                            <description>Trigger when TX FIFO contains  7 byte</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TXFLUSH</name>
                                <description>TX FIFO Flush
Setting this bit will Flush the TX FIFO.
Before clearing this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOFLUSH</name>
                                            <description>Do not Flush FIFO</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FLUSH</name>
                                            <description>Flush FIFO</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXFLUSH</name>
                                <description>RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before clearing this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOFLUSH</name>
                                            <description>Do not Flush FIFO</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FLUSH</name>
                                            <description>Flush FIFO</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXTRIG</name>
                                <description>RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LEVEL_5</name>
                                            <description>Trigger when RX FIFO contains &gt;= 5 byte</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LEVEL_6</name>
                                            <description>Trigger when RX FIFO contains &gt;= 6 byte</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LEVEL_7</name>
                                            <description>Trigger when RX FIFO contains &gt;= 7 byte</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LEVEL_8</name>
                                            <description>Trigger when RX FIFO contains &gt;= 8 byte</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2C2_TFIFOSR</name>
                        <description>I2C Target FIFO Status Register</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000800</resetValue>
                        <fields>
                            <field>
                                <name>RXFIFOCNT</name>
                                <description>Number of Bytes which could be read from the RX FIFO</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TXFIFOCNT</name>
                                <description>Number of Bytes which could be put into the TX FIFO</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TXFLUSH</name>
                                <description>TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INACTIVE</name>
                                            <description>FIFO Flush not active</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ACTIVE</name>
                                            <description>FIFO Flush active</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RXFLUSH</name>
                                <description>RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INACTIVE</name>
                                            <description>FIFOFlush not active</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ACTIVE</name>
                                            <description>FIFO Flush active</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2C2_TARGET_PECCTL</name>
                        <description>I2C Target PEC control register</description>
                        <addressOffset>0x24</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>PECCNT</name>
                                <description>When this field is non zero, the number of I2C data bytes are counted. When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Target use case, FW would set PECEN=1 and PECCNT=0 and use the ACKOEN until the remaining SMB packet length is known. FW would then set the PECCNT to the remaining packet length (Including PEC bye). FW would then configure DMA to allow the packet to complete unassisted and exit NoAck mode.

