theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN27</name>
                            <description>Programmable counter length of digital glitch filter for DIN27</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN28</name>
                            <description>Programmable counter length of digital glitch filter for DIN28</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN29</name>
                            <description>Programmable counter length of digital glitch filter for DIN29</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN30</name>
                            <description>Programmable counter length of digital glitch filter for DIN30</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN31</name>
                            <description>Programmable counter length of digital glitch filter for DIN31</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
