theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>FLASHCTL_BANK0INFO1</name>
                    <description>Bank Information Register 1 for Bank 0</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NONMAINSIZE</name>
                            <description>Non-main region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [NONMAINSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [NONMAINSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIMSIZE</name>
                            <description>Trim region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [TRIMSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [TRIMSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENGRSIZE</name>
                            <description>Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [ENGRSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [ENGRSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK1INFO0</name>
                    <description>Bank Information Register 0 for Bank 1</description>
                    <addressOffset>0x1410</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MAINSIZE</name>
                            <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [MAINSIZE]</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [MAINSIZE]</description>
                                        <value>0x200</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK1INFO1</name>
                    <description>Bank Information Register 1 for Bank 1</description>
                    <addressOffset>0x1414</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NONMAINSIZE</name>
                            <description>Non-main region size in sectors</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [NONMAINSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [NONMAINSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIMSIZE</name>
                            <description>Trim region size in sectors</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [TRIMSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [TRIMSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENGRSIZE</name>
                            <description>Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [ENGRSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [ENGRSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK2INFO0</name>
                    <description>Bank Information Register 0 for Bank 2</description>
                    <addressOffset>0x1420</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MAINSIZE</name>
                            <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [MAINSIZE]</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [MAINSIZE]</description>
                                        <value>0x200</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK2INFO1</name>
                    <description>Bank Information Register 1 for Bank 2</description>
                    <addressOffset>0x1424</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NONMAINSIZE</name>
                            <description>Non-main region size in sectors</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [NONMAINSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [NONMAINSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIMSIZE</name>
                            <description>Trim region size in sectors</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [TRIMSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [TRIMSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENGRSIZE</name>
                            <description>Engr region size in sectors</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [ENGRSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [ENGRSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK3INFO0</name>
                    <description>Bank Information Register 0 for Bank 3</description>
                    <addressOffset>0x1430</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MAINSIZE</name>
                            <description>Main region size in sectors</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [MAINSIZE]</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [MAINSIZE]</description>
                                        <value>0x200</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK3INFO1</name>
                    <description>Bank Information Register 1 for Bank 3</description>
                    <addressOffset>0x1434</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NONMAINSIZE</name>
                            <description>Non-main region size in sectors</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [NONMAINSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [NONMAINSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIMSIZE</name>
                            <description>Trim region size in sectors</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [TRIMSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [TRIMSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENGRSIZE</name>
                            <description>Engr region size in sectors</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [ENGRSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [ENGRSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK4INFO0</name>
                    <description>Bank Information Register 0 for Bank 4</description>
                    <addressOffset>0x1440</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MAINSIZE</name>
                            <description>Main region size in sectors</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [MAINSIZE]</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [MAINSIZE]</description>
                                        <value>0x200</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
