theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>AESADV_GCMCCM_TAG2</name>
                    <description>CBC-MAC third key / GCM &amp;amp; CCM Intermediate TAG</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_GCMCCM_TAG3</name>
                    <description>CBC-MAC third key (MSW) / GCM &amp;amp; CCM Intermediate TAG (MSW)</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_GHASH_H0</name>
                    <description>CCM &amp;amp; CBC-MAC second key (LSW) / GCM Hash Key input (LSW)</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_GHASH_H1</name>
                    <description>CCM &amp;amp; CBC-MAC second key  / GCM Hash Key input</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_GHASH_H2</name>
                    <description>CCM &amp;amp; CBC-MAC second key  / GCM Hash Key input</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_GHASH_H3</name>
                    <description>CCM &amp;amp; CBC-MAC second key (MSW) / GCM Hash Key input (MSW)</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY0</name>
                    <description>KEY (LSW)</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY1</name>
                    <description>KEY</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY2</name>
                    <description>KEY</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY3</name>
                    <description>KEY</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY4</name>
                    <description>KEY</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY5</name>
                    <description>KEY</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY6</name>
                    <description>KEY</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_KEY7</name>
                    <description>KEY (MSW)</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_IV0</name>
                    <description>IV (LSW)</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_IV1</name>
                    <description>IV</description>
                    <addressOffset>0x1144</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_IV2</name>
                    <description>IV</description>
                    <addressOffset>0x1148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_IV3</name>
                    <description>IV</description>
                    <addressOffset>0x114C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
