theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SAVED_CNTXT_RDY</name>
                            <description>If 1b, this read-only status bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the Host to retrieve. This bit is only asserted if the save_context bit is set to 1b. The bit is mutually exclusive with the context_ready bit.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOTREADY</name>
                                        <description>Not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READY</name>
                                        <description>Ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CNTXT_RDY</name>
                            <description>If 1b, this read-only status bit indicates that the context data registers can be overwritten, and the CPU is permitted to write the next context.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOTREADY</name>
                                        <description>Not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READY</name>
                                        <description>Ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>AESADV_C_LENGTH_0</name>
                    <description>Crypto data length (LSW)</description>
                    <addressOffset>0x1154</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_C_LENGTH_1</name>
                    <description>Crypto data length (MSW)</description>
                    <addressOffset>0x1158</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Bits [60:0] of the crypto length registers (LSW and MSW) store the cryptographic data length in bytes for all modes. Once processing with this context is started, this length decrements to zero. Data lengths up to (261-1) bytes are allowed.
For GCM, any value up to 236-32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 232-2, resulting in a maximum number of bytes of 236-32.
A write to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM.
Note that for the combined modes, this length does not include the authentication only data; the authentication length is specified in the AES_AAD_LENGTH register below.
All modes must have a length &gt; 0. For the combined modes, it is allowed to have one of the lengths equal to zero.
For the basic encryption modes (ECB/CBC/CTR/ICM/CFB/OFB) it is allowed to program zero to the length field; in that case the length is assumed infinite.
All data must be byte (8-bit) aligned for stream cipher modes; bit aligned data streams are not supported. For block cipher modes, the data length must be programmed in multiples of the block cipher size, 16 bytes.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1D</bitWidth>
                            <access>write-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>AESADV_AAD_LENGTH</name>
                    <description>AAD Data Length</description>
                    <addressOffset>0x115C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DATA0</name>
                    <description>Data input (LSW) / Data output (LSW)</description>
                    <addressOffset>0x1160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DATA1</name>
                    <description>Data input / Data output</description>
                    <addressOffset>0x1164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DATA2</name>
                    <description>Data input / Data output</description>
                    <addressOffset>0x1168</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DATA3</name>
                    <description>Data input (LSW) / Data output (MSW)</description>
                    <addressOffset>0x116C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_TAG0</name>
                    <description>Hash result (LSW)</description>
                    <addressOffset>0x1170</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_TAG1</name>
                    <description>Hash result</description>
                    <addressOffset>0x1174</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_TAG2</name>
                    <description>Hash result</description>
                    <addressOffset>0x1178</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_TAG3</name>
                    <description>Hash result (MSW)</description>
                    <addressOffset>0x117C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_STATUS</name>
                    <description>Status</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>KEYWR</name>
                            <description>Key write status. 0 - user write to KEY register is allowed. 1 - user write to KEY register is ignored.
In order to allow user write, perform a module reset.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description>User write to KEY MMR is allowed</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>User write to KEY MMR is disabled. Writing has no effect.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DATA_IN</name>
                    <description>Data in alias register</description>
                    <addressOffset>0x1184</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DATA_OUT</name>
                    <description>Data out alias register</description>
                    <addressOffset>0x1188</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_FORCE_IN_AV</name>
                    <description>Data control register for input data</description>
                    <addressOffset>0x11D0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_CCM_ALN_WRD</name>
                    <description>AES-CCM AAD alignment data word</description>
                    <addressOffset>0x11D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_BLK_CNT0</name>
                    <description>Internal block counter (LSW)</description>
                    <addressOffset>0x11D8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>AESADV_BLK_CNT1</name>
                    <description>Internal block counter (MSW)</description>
                    <addressOffset>0x11DC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Internal block counter for AES GCM and CCM operations.
These bits read the block count value that represents the number of blocks to go. This value is valid with saved_context_ready after a request for an intermediate GCM/CCM digest.
Writing these registers will restore the internal block counter to the programmed value. This only needs to be done to prepare the engine to continue processing of an interrupted GCM or CCM operation.
Also refer to the get_digest and gcm_ccm_continue bits in AES_CTRL register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x18</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>AESADV_DMA_HS</name>
                    <description>Control register for DMA handshaking</description>
                    <addressOffset>0x11F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMA_DATA_ACK</name>
                            <description>When this bit is 0b, input and output data acknowledge is I/O register based, as specified in the description of the AES_DATA_IN_n / AES_DATA_OUT_n registers.
When this bit is 1b, input and ouput data acknowledge is based on DMA handshake signals.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DMA_DISABLE</name>
                                        <description>Disable DMA based data handshake</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DMA_ENABLE</name>
                                        <description>Enables DMA based handshake</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
