theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>LFSS</name>
            <groupName>LFSS</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40094000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1600</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>LFSS_FPUB_0</name>
                    <description>Publisher Port 0</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_CLKSEL</name>
                    <description>Clock Select for Ultra Low Power peripherals</description>
                    <addressOffset>0x1004</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>LFCLK_SEL</name>
                            <description>Selects LFCLK as clock source if enabled</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>LFCLK is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>LFCLK is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>LFSS_CPU_INT[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>LFSS_CPU_INT_IIDX</name>
                        <description>Interrupt Index Register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No interrupt pending</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RTCRDY</name>
                                            <description>RTC ready</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RTCTEV</name>
                                            <description>RTC time event</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RTCA1</name>
                                            <description>RTC alarm 1</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RTCA2</name>
                                            <description>RTC alarm 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RT0PS</name>
                                            <description>RTC prescale timer 0</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RT1PS</name>
                                            <description>RTC prescale timer 1</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RT2PS</name>
                                            <description>RTC prescale timer 2</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TSEVT</name>
                                            <description>Time stamp event</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO0</name>
                                            <description>Tamper I/O 0 event</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO1</name>
                                            <description>Tamper I/O 1 event</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO2</name>
                                            <description>Tamper I/O 2 event</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO3</name>
                                            <description>Tamper I/O 3 event</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO4</name>
                                            <description>Tamper I/O 4 event</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO5</name>
                                            <description>Tamper I/O 5 event</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO6</name>
                                            <description>Tamper I/O 6 event</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO7</name>
                                            <description>Tamper I/O 7 event</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO8</name>
                                            <description>Tamper I/O 8 event</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO9</name>
                                            <description>Tamper I/O 9 event</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO10</name>
                                            <description>Tamper I/O 10 event</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO11</name>
                                            <description>Tamper I/O 11 event</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO12</name>
                                            <description>Tamper I/O 12 event</description>
                                            <value>0x15</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO13</name>
                                            <description>Tamper I/O 13 event</description>
                                            <value>0x16</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO14</name>
                                            <description>Tamper I/O 14 event</description>
                                            <value>0x17</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIO15</name>
                                            <description>Tamper I/O 15 event</description>
                                            <value>0x18</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
