theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO9</name>
                                <description>Tamper I/O 9 event</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO10</name>
                                <description>Tamper I/O 10 event</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO11</name>
                                <description>Tamper I/O 11 event</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO12</name>
                                <description>Tamper I/O 12 event</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO13</name>
                                <description>Tamper I/O 13 event</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO14</name>
                                <description>Tamper I/O 14 event</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TIO15</name>
                                <description>Tamper I/O 15 event</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt did not occur or is masked out</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Interrupt occurred</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
