theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LFSS_RTCLOCK</name>
                    <description>Real time clock lock register</description>
                    <addressOffset>0x11FC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>If set, the register bit will protect the CLKCTL, SEC, MIN, HOUR, DAY, MON, YEAR and LFSSRST from accidental writes.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>RTC counter is writable.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>RTC counter is read only access.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimArrayIndex>
                    <name>LFSS_TIOCTL[%s]</name>
                    <description>Tamper I/O Control Register</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IOMUX</name>
                            <description>tamper I/O is controlled by SoC IOMUX module</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>IOMUX</name>
                                        <description>The tamper I/O is controlled by the IOMUX of the SoC and does allow assignment to a peripheral function. In the case the main supply (VDD) is lost, this I/O will go into a Hi-Z state.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TAMPER</name>
                                        <description>The tamper I/O is controlled by the TIOCTL register and stays functional during loss of the main supply (VDD).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PIPD</name>
                            <description>pull down enable</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The pull-down function is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The pull-down function is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PIPU</name>
                            <description>pull up enable</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The pull-up function is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The pull-up function is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>INENA</name>
                            <description>input enable</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The input path is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The input path is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>POLARITY</name>
                            <description>Enables and configures edge detection polarity for TIO</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Edge detection disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RISE</name>
                                        <description>Detects rising edge of input event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FALL</name>
                                        <description>Detects falling edge of input event</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOTH</name>
                                        <description>Detects both rising and falling edge of input event</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FILTEREN</name>
                            <description>Programmable counter length of digital glitch filter for TIO0</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_FLT</name>
                                        <description>no filter on the tamper I/O beyond CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FLT_1</name>
                                        <description>1 FLCLK minimum sample (30us)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FLT_2</name>
                                        <description>3 LFCLK minimum sample (100us)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FLT_3</name>
                                        <description>6 LFCLK minimum sample (200us)</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TOUTSEL</name>
                            <description>Selects the source for TOUT control</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TOUT</name>
                                        <description>The TOUT register is the source for TOUT</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LFCLKEXT</name>
                                        <description>The LFCLK is the source for TOUT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HEARTBEAT</name>
                                        <description>The heart beat generatore is the source for TOUT</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TSEVTSTAT</name>
                                        <description>The time stamp event status is the source for TOUT</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>OUTINV</name>
                            <description>Output inversion enable</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISBALE</name>
                                        <description>The output inversion is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The output inversion is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_TOUT3_0</name>
                    <description>Tamper Output 3 to 0</description>
                    <addressOffset>0x1280</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TIO0</name>
                            <description>This bit sets the value of the pin tamper I/O 0 (TIO0) when the output is enabled through TOE0 register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TIO1</name>
                            <description>This bit sets the value of the pin tamper I/O 1 (TIO1) when the output is enabled through TOE1 register.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TIO2</name>
                            <description>This bit sets the value of the pin tamper I/O 2 (TIO0) when the output is enabled through TOE2 register.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TIO3</name>
                            <description>This bit sets the value of the pin tamper I/O 3 (TIO3) when the output is enabled through TOE3 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_TOUT7_4</name>
                    <description>Tamper Output 7 to 4</description>
                    <addressOffset>0x1284</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TIO4</name>
                            <description>This bit sets the value of the pin tamper I/O 4 (TIO4) when the output is enabled through TOE4 register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TIO5</name>
                            <description>This bit sets the value of the pin tamper I/O 5 (TIO5) when the output is enabled through TOE5 register.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TIO6</name>
                            <description>This bit sets the value of the pin tamper I/O 2 (TIO6) when the output is enabled through TOE6 register.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TIO7</name>
                            <description>This bit sets the value of the pin tamper I/O 7 (TIO7) when the output is enabled through TOE7 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Output is set to 0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>Output is set to 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
