theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LFSS_SPMWPROT6</name>
                    <description>Scratch Pad Memory Write Protect Register 6</description>
                    <addressOffset>0x1518</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>WP_27_3</name>
                            <description>write protect SPMEM27 - DATA3</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_27_2</name>
                            <description>write protect SPMEM27 - DATA2</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_27_1</name>
                            <description>write protect SPMEM27 - DATA1</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_27_0</name>
                            <description>write protect SPMEM27 - DATA0</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_26_3</name>
                            <description>write protect SPMEM26 - DATA3</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_26_2</name>
                            <description>write protect SPMEM26- DATA2</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_26_1</name>
                            <description>write protect SPMEM26 - DATA1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_26_0</name>
                            <description>write protect SPMEM26 - DATA0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_25_3</name>
                            <description>write protect SPMEM25 - DATA3</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_25_2</name>
                            <description>write protect SPMEM25 - DATA2</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_25_1</name>
                            <description>write protect SPMEM25 - DATA1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_25_0</name>
                            <description>write protect SPMEM25 - DATA0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_24_3</name>
                            <description>write protect SPMEM24 - DATA3</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_24_2</name>
                            <description>write protect SPMEM24 - DATA2</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_24_1</name>
                            <description>write protect SPMEM24 - DATA1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_24_0</name>
                            <description>write protect SPMEM24 - DATA0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
