theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LFSS_SPMWPROT7</name>
                    <description>Scratch Pad Memory Write Protect Register 7</description>
                    <addressOffset>0x151C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>WP_31_3</name>
                            <description>write protect SPMEM31 - DATA3</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_31_2</name>
                            <description>write protect SPMEM31 - DATA2</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_31_1</name>
                            <description>write protect SPMEM31 - DATA1</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_31_0</name>
                            <description>write protect SPMEM31 - DATA0</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_30_3</name>
                            <description>write protect SPMEM30 - DATA3</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_30_2</name>
                            <description>write protect SPMEM30- DATA2</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_30_1</name>
                            <description>write protect SPMEM30 - DATA1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_30_0</name>
                            <description>write protect SPMEM30 - DATA0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_29_3</name>
                            <description>write protect SPMEM29 - DATA3</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_29_2</name>
                            <description>write protect SPMEM29 - DATA2</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_29_1</name>
                            <description>write protect SPMEM29 - DATA1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_29_0</name>
                            <description>write protect SPMEM29 - DATA0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_28_3</name>
                            <description>write protect SPMEM28 - DATA3</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_28_2</name>
                            <description>write protect SPMEM28 - DATA2</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_28_1</name>
                            <description>write protect SPMEM28 - DATA1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WP_28_0</name>
                            <description>write protect SPMEM28 - DATA0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READWRITE</name>
                                        <description>SPMEM is read and write access</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READONLY</name>
                                        <description>SPMEM is read only access</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
