theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LFSS_SPMTERASE0</name>
                    <description>Scratch Pad Memory Tamper Erase Register 0</description>
                    <addressOffset>0x1540</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TE_3_3</name>
                            <description>tamper erase enable SPMEM3 - DATA3</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_3_2</name>
                            <description>tamper erase enable SPMEM3 - DATA2</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_3_1</name>
                            <description>tamper erase enable SPMEM3 - DATA1</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_3_0</name>
                            <description>tamper erase enable SPMEM3 - DATA0</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_2_3</name>
                            <description>tamper erase enable SPMEM2 - DATA3</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_2_2</name>
                            <description>tamper erase enable SPMEM2 - DATA2</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_2_1</name>
                            <description>tamper erase enable SPMEM2 - DATA1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_2_0</name>
                            <description>tamper erase enable SPMEM2 - DATA0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_1_3</name>
                            <description>tamper erase enable SPMEM1 - DATA3</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_1_2</name>
                            <description>tamper erase enable SPMEM1 - DATA2</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_1_1</name>
                            <description>tamper erase enable SPMEM1 - DATA1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_1_0</name>
                            <description>tamper erase enable SPMEM1 - DATA0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_0_3</name>
                            <description>tamper erase enable SPMEM0 - DATA3</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_0_2</name>
                            <description>tamper erase enable SPMEM0 - DATA2</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_0_1</name>
                            <description>tamper erase enable SPMEM0 - DATA1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_0_0</name>
                            <description>tamper erase enable SPMEM0 - DATA0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
