theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LFSS_SPMTERASE1</name>
                    <description>Scratch Pad Memory Tamper Erase Register 1</description>
                    <addressOffset>0x1544</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TE_7_3</name>
                            <description>tamper erase enable SPMEM7 - DATA3</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_7_2</name>
                            <description>tamper erase enable SPMEM7 - DATA2</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_7_1</name>
                            <description>tamper erase enable SPMEM7 - DATA1</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_7_0</name>
                            <description>tamper erase enable SPMEM7 - DATA0</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_6_3</name>
                            <description>tamper erase enable SPMEM6 - DATA3</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_6_2</name>
                            <description>tamper erase enable SPMEM6 - DATA2</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_6_1</name>
                            <description>tamper erase enable SPMEM6 - DATA1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_6_0</name>
                            <description>tamper erase enable SPMEM6 - DATA0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_5_3</name>
                            <description>tamper erase enable SPMEM5 - DATA3</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_5_2</name>
                            <description>tamper erase enable SPMEM5 - DATA2</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_5_1</name>
                            <description>tamper erase enable SPMEM5 - DATA1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_5_0</name>
                            <description>tamper erase enable SPMEM5 - DATA0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_4_3</name>
                            <description>tamper erase enable SPMEM4 - DATA3</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_4_2</name>
                            <description>tamper erase enable SPMEM4 - DATA2</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_4_1</name>
                            <description>tamper erase enable SPMEM4 - DATA1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TE_4_0</name>
                            <description>tamper erase enable SPMEM4 - DATA0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SPMEM is unmodified during tamper event</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SPMEM will be erased with tamper event</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
