theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>SYSCTL_NMIICLR</name>
                    <description>NMI interrupt clear</description>
                    <addressOffset>0x1078</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007f</resetMask>
                    <fields>
                        <field>
                            <name>SRAMDED</name>
                            <description>SRAM Double Error Detect</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BORLVL</name>
                            <description>Clr the BORLVL NMI</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Writing 0h hs no effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Clear interrupt</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>VBATDN</name>
                            <description>VBAT Power Off</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLASHDED</name>
                            <description>Flash Double Error Detect</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WWDT0</name>
                            <description>Watch Dog 0 Fault</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>VBATUP</name>
                            <description>VBAT Power On</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LFCLKFAIL</name>
                            <description>LFXT-EXLF Monitor Fail</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSOSCCFG</name>
                    <description>SYSOSC configuration</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00020000</resetValue>
                    <resetMask>0x00030703</resetMask>
                    <fields>
                        <field>
                            <name>USE4MHZSTOP</name>
                            <description>USE4MHZSTOP sets the SYSOSC stop mode frequency policy.  When entering STOP mode, the SYSOSC frequency may be automatically switched to 4MHz to reduce SYSOSC power consumption.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Do not gear shift the SYSOSC to 4MHz in STOP mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Gear shift SYSOSC to 4MHz in STOP mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISABLESTOP</name>
                            <description>DISABLESTOP sets the SYSOSC stop mode enable/disable policy.  When operating in STOP mode, the SYSOSC may be automatically disabled.  When set, ULPCLK will run from LFCLK in STOP mode and SYSOSC will be disabled to reduce power consumption.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Do not disable SYSOSC in STOP mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Disable SYSOSC in STOP mode and source ULPCLK from LFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BLOCKASYNCALL</name>
                            <description>BLOCKASYNCALL may be used to mask block all asynchronous fast clock requests, preventing hardware from dynamically changing the active clock configuration when operating in a given mode.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Asynchronous fast clock requests are controlled by the requesting peripheral</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>All asynchronous fast clock requests are blocked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISABLE</name>
                            <description>DISABLE sets the SYSOSC enable/disable policy.  SYSOSC may be powered off in RUN, SLEEP, and STOP modes to reduce power consumption.  When SYSOSC is disabled, MCLK and ULPCLK are sourced from LFCLK.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Do not disable SYSOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Disable SYSOSC immediately and source MCLK and ULPCLK from LFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FASTCPUEVENT</name>
                            <description>FASTCPUEVENT may be used to assert a fast clock request when an interrupt is asserted to the CPU, reducing interrupt latency.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>An interrupt to the CPU will not assert a fast clock request</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt to the CPU will assert a fast clock request</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FREQ</name>
                            <description>Target operating frequency for the system oscillator (SYSOSC)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSCBASE</name>
                                        <description>Base frequency (32MHz)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSC4M</name>
                                        <description>Low frequency (4MHz)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSCUSER</name>
                                        <description>User-trimmed frequency (16 or 24 MHz)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
