theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>SYSCTL_MCLKCFG</name>
                    <description>Main clock (MCLK) configuration</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <resetMask>0x00711f0f</resetMask>
                    <fields>
                        <field>
                            <name>USEMFTICK</name>
                            <description>USEMFTICK specifies whether the 4MHz constant-rate clock (MFCLK) to peripherals is enabled or disabled.  When enabled, MDIV must be disabled (set to 0h=/1).</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The 4MHz rate MFCLK to peripherals is enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The 4MHz rate MFCLK to peripherals is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MDIV</name>
                            <description>MDIV may be used to divide the MCLK frequency when MCLK is sourced from SYSOSC.  MDIV=0h corresponds to /1 (no divider).  MDIV=1h corresponds to /2 (divide-by-2).  MDIV=Fh corresponds to /16 (divide-by-16).  MDIV may be set between /1 and /16 on an integer basis.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>USEHSCLK</name>
                            <description>USEHSCLK, together with USELFCLK, sets the MCLK source policy.  Set USEHSCLK to use HSCLK (HFCLK or SYSPLL) as the MCLK source in RUN and SLEEP modes.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>MCLK will not use the high speed clock (HSCLK)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>MCLK will use the high speed clock (HSCLK) in RUN and SLEEP mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>USELFCLK</name>
                            <description>USELFCLK sets the MCLK source policy.  Set USELFCLK to use LFCLK as the MCLK source.  Note that setting USELFCLK does not disable SYSOSC, and SYSOSC remains available for direct use by analog modules.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>MCLK will not use the low frequency clock (LFCLK)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>MCLK will use the low frequency clock (LFCLK)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STOPCLKSTBY</name>
                            <description>STOPCLKSTBY sets the STANDBY mode policy (STANDBY0 or STANDBY1).  When set, ULPCLK and LFCLK are disabled to all peripherals in STANDBY mode, with the exception of TIMG0 and TIMG1 which continue to run.  Wake-up is only possible via an asynchronous fast clock request.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>ULPCLK/LFCLK runs to all PD0 peripherals in STANDBY mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>ULPCLK/LFCLK is disabled to all peripherals in STANDBY mode except TIMG0 and TIMG1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLASHWAIT</name>
                            <description>FLASHWAIT specifies the number of flash wait states when MCLK is sourced from HSCLK.  FLASHWAIT has no effect when MCLK is sourced from SYSOSC or LFCLK.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>WAIT0</name>
                                        <description>No flash wait states are applied</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>WAIT1</name>
                                        <description>One flash wait state is applied</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>WAIT2</name>
                                        <description>2 flash wait states are applied</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MCLKDEADCHK</name>
                            <description>MCLKDEADCHK enables or disables the continuous MCLK dead check monitor.  LFCLK must be running before MCLKDEADCHK is enabled.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The MCLK dead check monitor is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The MCLK dead check monitor is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_HSCLKEN</name>
                    <description>High-speed clock (HSCLK) source enable/disable</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010001</resetMask>
                    <fields>
                        <field>
                            <name>HFXTEN</name>
                            <description>HFXTEN enables or disables the high frequency crystal oscillator (HFXT).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable the HFXT</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable the HFXT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>USEEXTHFCLK</name>
                            <description>USEEXTHFCLK selects the HFCLK_IN digital clock input to be the source for HFCLK.  When disabled, HFXT is the HFCLK source and HFXTEN may be set.  Do not set HFXTEN and USEEXTHFCLK simultaneously.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Use HFXT as the HFCLK source</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Use the HFCLK_IN digital clock input as the HFCLK source</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_HSCLKCFG</name>
                    <description>High-speed clock (HSCLK) source selection</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>HSCLKSEL</name>
                            <description>HSCLKSEL selects the HSCLK source (SYSPLL or HFCLK).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>HFCLKCLK</name>
                                        <description>HSCLK is sourced from the HFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_HFCLKCLKCFG</name>
                    <description>High-frequency clock (HFCLK) configuration</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10000000</resetValue>
                    <resetMask>0x100030ff</resetMask>
                    <fields>
                        <field>
                            <name>HFXTTIME</name>
                            <description>HFXTTIME specifies the HFXT startup time in 64us resolution.  If the HFCLK startup monitor is enabled (HFCLKFLTCHK), HFXT will be checked after this time expires.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSTARTTIME</name>
                                        <description>Minimum startup time (approximatly zero)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSTARTTIME</name>
                                        <description>Maximum startup time (approximatly 16.32ms)</description>
                                        <value>0xFF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFCLKFLTCHK</name>
                            <description>HFCLKFLTCHK enables or disables the HFCLK startup monitor.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>HFCLK startup is not checked</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>HFCLK startup is checked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFXTRSEL</name>
                            <description>HFXT Range Select</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>RANGE4TO8</name>
                                        <description>4MHz &amp;lt;= HFXT frequency &amp;lt;= 8MHz</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RANGE8TO16</name>
                                        <description>8MHz &amp;lt; HFXT frequency &amp;lt;= 16MHz</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RANGE16TO32</name>
                                        <description>16MHz &amp;lt; HFXT frequency &amp;lt;= 32MHz</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RANGE32TO48</name>
                                        <description>32MHz &amp;lt; HFXT frequency &amp;lt;= 48MHz</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_LFCLKCFG</name>
                    <description>Low frequency crystal oscillator (LFXT) configuration</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000113</resetMask>
                    <fields>
                        <field>
                            <name>XT1DRIVE</name>
                            <description>XT1DRIVE selects the low frequency crystal oscillator (LFXT) drive strength.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOWESTDRV</name>
                                        <description>Lowest drive and current</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LOWERDRV</name>
                                        <description>Lower drive and current</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGHERDRV</name>
                                        <description>Higher drive and current</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGHESTDRV</name>
                                        <description>Highest drive and current</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MONITOR</name>
                            <description>MONITOR enables or disables the LFCLK monitor, which continuously checks LFXT or LFCLK_IN for a clock stuck fault.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Clock monitor is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Clock monitor is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LOWCAP</name>
                            <description>LOWCAP controls the low-power LFXT mode.  When the LFXT load capacitance is less than 3pf, LOWCAP may be set for reduced power consumption.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>LFXT low capacitance mode is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>LFXT low capacitance mode is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
