theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>SYSCTL_FRXPROTMAINEND</name>
                    <description>Flash RX Protection End Address</description>
                    <addressOffset>0x301C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash RX Protection End Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FIPPROTMAINSTART</name>
                    <description>Flash IP Protection Start Address</description>
                    <addressOffset>0x3020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash IP Protection Start Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FIPPROTMAINEND</name>
                    <description>Flash IP Protection End Address</description>
                    <addressOffset>0x3024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash IP Protection End Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FLBANKSWPPOLICY</name>
                    <description>Flash Bank Swap Policy</description>
                    <addressOffset>0x3038</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>DISABLE</name>
                            <description>1: Disables Policy To Allow Flash Bank Swapping</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Disallow Bank Swap</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FLBANKSWP</name>
                    <description>Flash MAIN bank address swap</description>
                    <addressOffset>0x303C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>USEUPPER</name>
                            <description>1: Use Upper Bank as Logical 0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Normal (default) memory map addressing scheme</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Flash upper region address space swapped with lower region</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FWENABLE</name>
                    <description>Security Firewall Enable Register</description>
                    <addressOffset>0x3044</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000150</resetMask>
                    <fields>
                        <field>
                            <name>FLIPPROT</name>
                            <description>1: Flash Read IP ProtectionActive</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Turn On Flash IP Protection</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SRAMBOUNDARYLOCK</name>
                            <description>1: Blocks Writes from Changing SRAMBOUNDARY MMR</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SRAMBOUNDARY MMR Locked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLRXPROT</name>
                            <description>1: Flash Read Execute Protection Active</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Turn On Flash Read-eXecute Protection</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SECSTATUS</name>
                    <description>Security Configuration  status</description>
                    <addressOffset>0x3048</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001555</resetMask>
                    <fields>
                        <field>
                            <name>FLBANKSWPPOLICY</name>
                            <description>1: Upper and Lower Banks allowed to be swapped</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLIPPROT</name>
                            <description>1: Flash IP Protection Active</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLBANKSWP</name>
                            <description>1: Upper and Lower Banks have been swapped</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>SRAMBOUNDARYLOCK</name>
                            <description>1: SRAM Boundary MMR Locked</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLRXPROT</name>
                            <description>1: Flash Read Execute Protection Active</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>INITDONE</name>
                            <description>1: CSC has been completed</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO</name>
                                        <description>INIT is not yet done</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>YES</name>
                                        <description>INIT is done</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CSCEXISTS</name>
                            <description>1: CSC Exists in the system</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO</name>
                                        <description>System does not have a CSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>YES</name>
                                        <description>System does have a CSC</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_INITDONE</name>
                    <description>INITCODE PASS</description>
                    <addressOffset>0x3060</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>PASS</name>
                            <description>INITCODE writes 1 for PASS, left unwritten a timeout will occur if not blocked</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>INITCODE PASS</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_ADC12B1MSPS0_PWREN</name>
                    <description>IP Enable Register</description>
                    <addressOffset>0x4800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>IP Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Disable</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Enable</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_ADC12B1MSPS0_RSTCTL</name>
                    <description>Power Control Register - Write Only Register, Always Read as 0</description>
                    <addressOffset>0x4804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKYCLR</name>
                            <description>Clear the RESET STICKY Bit</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Clear</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETASSERT</name>
                            <description>Assert Reset to IP Domain.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Do</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
