theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>SYSCTL_MGMT_SPI0_RSTCTL</name>
                    <description>Power Control Register - Write Only Register, Always Read as 0</description>
                    <addressOffset>0x468804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKYCLR</name>
                            <description>Clear the RESET STICKY Bit</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Clear</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETASSERT</name>
                            <description>Assert Reset to IP Domain.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Do</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_SPI0_CLKCFG</name>
                    <description>IP Clock Configuration Register</description>
                    <addressOffset>0x468808</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000100</resetMask>
                    <fields>
                        <field>
                            <name>BLOCKASYNC</name>
                            <description>Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Disable</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Enable</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_SPI0_STAT</name>
                    <description>IP State Register - Read Only</description>
                    <addressOffset>0x468814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010000</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKY</name>
                            <description>IP has been Reset</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>clear</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Set</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_SPI1_PWREN</name>
                    <description>IP Enable Register</description>
                    <addressOffset>0x46A800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>IP Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Disable</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Enable</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_SPI1_RSTCTL</name>
                    <description>Power Control Register - Write Only Register, Always Read as 0</description>
                    <addressOffset>0x46A804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKYCLR</name>
                            <description>Clear the RESET STICKY Bit</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Clear</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETASSERT</name>
                            <description>Assert Reset to IP Domain.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Do</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_SPI1_CLKCFG</name>
                    <description>IP Clock Configuration Register</description>
                    <addressOffset>0x46A808</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000100</resetMask>
                    <fields>
                        <field>
                            <name>BLOCKASYNC</name>
                            <description>Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Disable</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Enable</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_SPI1_STAT</name>
                    <description>IP State Register - Read Only</description>
                    <addressOffset>0x46A814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010000</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKY</name>
                            <description>IP has been Reset</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>clear</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Set</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_GPTIMER16BADV4CC0_PWREN</name>
                    <description>IP Enable Register</description>
                    <addressOffset>0x860800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>IP Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Disable</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Enable</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_GPTIMER16BADV4CC0_RSTCTL</name>
                    <description>Power Control Register - Write Only Register, Always Read as 0</description>
                    <addressOffset>0x860804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKYCLR</name>
                            <description>Clear the RESET STICKY Bit</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Clear</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETASSERT</name>
                            <description>Assert Reset to IP Domain.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Do</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_GPTIMER16BADV4CC0_STAT</name>
                    <description>IP State Register - Read Only</description>
                    <addressOffset>0x860814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010000</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKY</name>
                            <description>IP has been Reset</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>clear</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Set</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_GPTIMER32B2CC0_PWREN</name>
                    <description>IP Enable Register</description>
                    <addressOffset>0x870800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>IP Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Disable</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Enable</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_GPTIMER32B2CC0_RSTCTL</name>
                    <description>Power Control Register - Write Only Register, Always Read as 0</description>
                    <addressOffset>0x870804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKYCLR</name>
                            <description>Clear the RESET STICKY Bit</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Clear</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESETASSERT</name>
                            <description>Assert Reset to IP Domain.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Do</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MGMT_GPTIMER32B2CC0_STAT</name>
                    <description>IP State Register - Read Only</description>
                    <addressOffset>0x870814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010000</resetMask>
                    <fields>
                        <field>
                            <name>RESETSTKY</name>
                            <description>IP has been Reset</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>clear</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Set</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
