theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LCD_LCDCTL0</name>
                    <description>LCD control register 0</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LCDDIVx</name>
                            <description>LCD frequency divider. Together with LCDMXx, the LCD frequency fLCD is calculated as fLCD = fSOURCE / ((LCDDIVx + 1) * Value[LCDMXx]). Change only while LCDON = 0.  00000b = Divide by 1 00001b = Divide by 2 .  11110b = Divide by 31 11111b = Divide by 32</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIV_BY_1</name>
                                        <description>Divide by 1</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_2</name>
                                        <description>Divide by 2</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_3</name>
                                        <description>Divide by 3</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_4</name>
                                        <description>Divide by 4</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_5</name>
                                        <description>Divide by 5</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_6</name>
                                        <description>Divide by 6</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_7</name>
                                        <description>Divide by 7</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_8</name>
                                        <description>Divide by 8</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_9</name>
                                        <description>Divide by 9</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_10</name>
                                        <description>Divide by 10</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_11</name>
                                        <description>Divide by 11</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_12</name>
                                        <description>Divide by 12</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_13</name>
                                        <description>Divide by 13</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_14</name>
                                        <description>Divide by 14</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_15</name>
                                        <description>Divide by 15</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_16</name>
                                        <description>Divide by 16</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_17</name>
                                        <description>Divide by 17</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_18</name>
                                        <description>Divide by 18</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_19</name>
                                        <description>Divide by 19</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_20</name>
                                        <description>Divide by 20</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_21</name>
                                        <description>Divide by 21</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_22</name>
                                        <description>Divide by 22</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_23</name>
                                        <description>Divide by 23</description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_24</name>
                                        <description>Divide by 24</description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_25</name>
                                        <description>Divide by 25</description>
                                        <value>0x18</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_26</name>
                                        <description>Divide by 26</description>
                                        <value>0x19</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_27</name>
                                        <description>Divide by 27</description>
                                        <value>0x1A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_28</name>
                                        <description>Divide by 28</description>
                                        <value>0x1B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_29</name>
                                        <description>Divide by 29</description>
                                        <value>0x1C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_30</name>
                                        <description>Divide by 30</description>
                                        <value>0x1D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_31</name>
                                        <description>Divide by 31</description>
                                        <value>0x1E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_32</name>
                                        <description>Divide by 32</description>
                                        <value>0x1F</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDLP</name>
                            <description>LCD low-power waveform. This bit is only applicable for 1/3 bias mode, that is, for LCDBIASSEL = 0.  0b = Standard LCD waveforms on segment and common lines selected.  1b = Low-power LCD waveforms on segment and common lines selected.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STD_LCD</name>
                                        <description>Standard LCD waveforms</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LP_LCD</name>
                                        <description>Low power LCD waveforms</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDMXx</name>
                            <description>LCD mux rate. These bits select the LCD mode. Change only while LCDON = 0.  000b = Static 001b = 2-mux 010b = 3-mux 011b = 4-mux 100b = 5-mux 101b = 6-mux 110b = 7-mux 111b = 8-mux</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Mx_STATIC</name>
                                        <description>Static</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_2</name>
                                        <description>2-mux</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_3</name>
                                        <description>3-mux</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_4</name>
                                        <description>4-mux</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_5</name>
                                        <description>5-mux</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_6</name>
                                        <description>6-mux</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_7</name>
                                        <description>7-mux</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MX_8</name>
                                        <description>8-mux</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDON</name>
                            <description>LCD on. This bit turns the LCD module on or off.  0b = LCD module off 1b = LCD module on</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LCD_MOD_DISABLE</name>
                                        <description>LCD module off</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LCD_MOD_ENABLE</name>
                                        <description>LCD module on</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDSON</name>
                            <description>LCD segments on. This bit supports flashing LCD applications by turning off all segment lines, while leaving the LCD timing generator and R33 enabled.  0b = All LCD segments are off.  1b = All LCD segments are enabled and on or off according to their corresponding memory location.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LCD_SEG_OFF</name>
                                        <description>All LCD segments are off.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LCD_SEG_ON</name>
                                        <description>All LCD segments are enabled and on or off according to their corresponding memory location.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDSYNCEXT</name>
                            <description></description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LCD_EXT_SYNC_OFF</name>
                                        <description>External eynchronization off.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LCD_EXT_SYNC_ON</name>
                                        <description>External synchronization on.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
