theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LCD_LCDBLKCTL</name>
                    <description>LCD blicking control register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LCDBLKMODx</name>
                            <description>Blinking mode 00b = Blinking disabled.  01b = Blinking of individual segments as enabled in blinking memory register LCDBMx. In mux mode &gt;5 blinking is disabled.  10b = Blinking of all segments 11b = Switching between display contents as stored in LCDMx and LCDBMx memory registers. In mux mode &gt;5 blinking is disabled.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BLINK_DISABLE</name>
                                        <description>Blinking disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLINK_SELECED</name>
                                        <description>Blinking of individual segments as enabled in blinking memory register LCDBMx. In mux mode &gt;5 blinking is disabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLINK_ALL</name>
                                        <description>Blinking of all segments</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BKINK_TOGGLE</name>
                                        <description>Switching between display contents as stored in LCDMx and LCDBMx memory registers. In mux mode &gt;5 blinking is disabled.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDBLKPREx</name>
                            <description>Clock prescaler for blinking frequency.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIV_BY_2</name>
                                        <description>Divide by 2</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_4</name>
                                        <description>Divide by 4</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_8</name>
                                        <description>Divide by 8</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_16</name>
                                        <description>Divide by 16</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_32</name>
                                        <description>Divide by 32</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_64</name>
                                        <description>Divide by 64</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_128</name>
                                        <description>Divide by 128</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_256</name>
                                        <description>Divide by 256</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LCD_LCDMEMCTL</name>
                    <description>LCD memory control LCD memory control register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LCDCLRBM</name>
                            <description>Clear LCD blinking memory Clears all blinking memory registers LCDBMx. The bit is automatically reset when the blinking memory is cleared.  Setting this bit in 5-mux mode and above has no effect. It is immediately reset again.  0b = Contents of blinking memory registers LCDBMx remain unchanged 1b = Clear content of all blinking memory registers LCDBMx</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_CLR_BLNK_MEM_REGS</name>
                                        <description>Contents of blinking memory registers LCDBMx remain unchanged</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR_BLNK_MEM_REGS</name>
                                        <description>Clear content of all blinking memory registers LCDBMx</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDCLRM</name>
                            <description>Clear LCD memory Clears all LCD memory registers LCDMx. The bit is automatically reset when the LCD memory is cleared.  0b = Contents of LCD memory registers LCDMx remain unchanged 1b = Clear content of all LCD memory registers LCDMx</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_CLR_LCD_MEM_REGS</name>
                                        <description>Contents of LCD memory registers LCDMx remain unchanged</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLR_LCD_MEM_REGS</name>
                                        <description>Clear content of all LCD memory registers LCDMx</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDDISP</name>
                            <description>Select LCD memory registers for display When LCDBLKMODx = 00, LCDDISP can be set by software.  The bit is cleared in LCDBLKMODx = 01 and LCDBLKMODx = 10 or if a mux mode =5 is selected and cannot be changed by software.  When LCDBLKMODx = 11, this bit reflects the currently displayed memory but cannot be changed by software. When returning to LCDBLKMODx = 00 the bit is cleared.  0b = Display content of LCD memory registers LCDMx 1b = Display content of LCD blinking memory registers LCDBMx</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_LCD_MEM_REGS</name>
                                        <description>Display content of LCD memory registers LCDMx</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_BLNK_MEM_REGS</name>
                                        <description>Display content of LCD blinking memory registers LCDBMx</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
