theKnightsOfRohan/rainbow/rainbow/devices/MSPM0L222X.svd
                <register>
                    <name>LCD_LCDPCTL0</name>
                    <description>LCD port control register 0</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LCDS0</name>
                            <description>LCD pin 0 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS1</name>
                            <description>LCD pin 1 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS10</name>
                            <description>LCD pin 10 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS11</name>
                            <description>LCD pin 11 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS12</name>
                            <description>LCD pin 12 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS13</name>
                            <description>LCD pin 13 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS14</name>
                            <description>LCD pin 14 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS15</name>
                            <description>LCD pin 15 enable. This bit affects only pins with multiplexed functions.  Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS2</name>
                            <description>LCD pin 2 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS3</name>
                            <description>LCD pin 3 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS4</name>
                            <description>LCD pin 4 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS5</name>
                            <description>LCD pin 5 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS6</name>
                            <description>LCD pin 6 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS7</name>
                            <description>LCD pin 7 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS8</name>
                            <description>LCD pin 8 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LCDS9</name>
                            <description>LCD pin 9 enable. This bit affects only pins with multiplexed functions. Dedicated LCD pins are always LCD function.  0b = Multiplexed pins are port functions.  1b = Pins are LCD functions.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SEL_PORT</name>
                                        <description>Multiplexed pins are port functions.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SEL_LCD</name>
                                        <description>Pins are LCD functions.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
